ir_version: 7
producer_name: "pytorch+onnx_optimizer"
producer_version: "1.7+0.9"
model_version: 0
graph {
  name: "torch-jit-export"
  node {
    input: "images"
    input: "479"
    input: "465"
    input: "463"
    input: "463"
    output: "497"
    name: "Slice_34"
    op_type: "Slice"
  }
  node {
    input: "images"
    input: "464"
    input: "465"
    input: "463"
    input: "463"
    output: "477"
    name: "Slice_14"
    op_type: "Slice"
  }
  node {
    input: "497"
    input: "479"
    input: "465"
    input: "468"
    input: "463"
    output: "502"
    name: "Slice_39"
    op_type: "Slice"
  }
  node {
    input: "497"
    input: "464"
    input: "465"
    input: "468"
    input: "463"
    output: "492"
    name: "Slice_29"
    op_type: "Slice"
  }
  node {
    input: "477"
    input: "479"
    input: "465"
    input: "468"
    input: "463"
    output: "482"
    name: "Slice_19"
    op_type: "Slice"
  }
  node {
    input: "477"
    input: "464"
    input: "465"
    input: "468"
    input: "463"
    output: "472"
    name: "Slice_9"
    op_type: "Slice"
  }
  node {
    input: "472"
    input: "492"
    input: "482"
    input: "502"
    output: "503"
    name: "Concat_40"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "503"
    input: "878"
    input: "879"
    output: "877"
    name: "Conv_41"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "877"
    output: "506"
    name: "Sigmoid_42"
    op_type: "Sigmoid"
  }
  node {
    input: "877"
    input: "506"
    output: "507"
    name: "Mul_43"
    op_type: "Mul"
  }
  node {
    input: "507"
    input: "881"
    input: "882"
    output: "880"
    name: "Conv_44"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "880"
    output: "510"
    name: "Sigmoid_45"
    op_type: "Sigmoid"
  }
  node {
    input: "880"
    input: "510"
    output: "511"
    name: "Mul_46"
    op_type: "Mul"
  }
  node {
    input: "511"
    input: "887"
    input: "888"
    output: "886"
    name: "Conv_50"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "511"
    input: "884"
    input: "885"
    output: "883"
    name: "Conv_47"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "886"
    output: "518"
    name: "Sigmoid_51"
    op_type: "Sigmoid"
  }
  node {
    input: "883"
    output: "514"
    name: "Sigmoid_48"
    op_type: "Sigmoid"
  }
  node {
    input: "886"
    input: "518"
    output: "519"
    name: "Mul_52"
    op_type: "Mul"
  }
  node {
    input: "883"
    input: "514"
    output: "515"
    name: "Mul_49"
    op_type: "Mul"
  }
  node {
    input: "515"
    input: "890"
    input: "891"
    output: "889"
    name: "Conv_53"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "889"
    output: "522"
    name: "Sigmoid_54"
    op_type: "Sigmoid"
  }
  node {
    input: "889"
    input: "522"
    output: "523"
    name: "Mul_55"
    op_type: "Mul"
  }
  node {
    input: "523"
    input: "893"
    input: "894"
    output: "892"
    name: "Conv_56"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "892"
    output: "526"
    name: "Sigmoid_57"
    op_type: "Sigmoid"
  }
  node {
    input: "892"
    input: "526"
    output: "527"
    name: "Mul_58"
    op_type: "Mul"
  }
  node {
    input: "527"
    input: "515"
    output: "528"
    name: "Add_59"
    op_type: "Add"
  }
  node {
    input: "528"
    input: "519"
    output: "529"
    name: "Concat_60"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "529"
    input: "896"
    input: "897"
    output: "895"
    name: "Conv_61"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "895"
    output: "532"
    name: "Sigmoid_62"
    op_type: "Sigmoid"
  }
  node {
    input: "895"
    input: "532"
    output: "533"
    name: "Mul_63"
    op_type: "Mul"
  }
  node {
    input: "533"
    input: "899"
    input: "900"
    output: "898"
    name: "Conv_64"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "898"
    output: "536"
    name: "Sigmoid_65"
    op_type: "Sigmoid"
  }
  node {
    input: "898"
    input: "536"
    output: "537"
    name: "Mul_66"
    op_type: "Mul"
  }
  node {
    input: "537"
    input: "905"
    input: "906"
    output: "904"
    name: "Conv_70"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "537"
    input: "902"
    input: "903"
    output: "901"
    name: "Conv_67"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "904"
    output: "544"
    name: "Sigmoid_71"
    op_type: "Sigmoid"
  }
  node {
    input: "901"
    output: "540"
    name: "Sigmoid_68"
    op_type: "Sigmoid"
  }
  node {
    input: "904"
    input: "544"
    output: "545"
    name: "Mul_72"
    op_type: "Mul"
  }
  node {
    input: "901"
    input: "540"
    output: "541"
    name: "Mul_69"
    op_type: "Mul"
  }
  node {
    input: "541"
    input: "908"
    input: "909"
    output: "907"
    name: "Conv_73"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "907"
    output: "548"
    name: "Sigmoid_74"
    op_type: "Sigmoid"
  }
  node {
    input: "907"
    input: "548"
    output: "549"
    name: "Mul_75"
    op_type: "Mul"
  }
  node {
    input: "549"
    input: "911"
    input: "912"
    output: "910"
    name: "Conv_76"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "910"
    output: "552"
    name: "Sigmoid_77"
    op_type: "Sigmoid"
  }
  node {
    input: "910"
    input: "552"
    output: "553"
    name: "Mul_78"
    op_type: "Mul"
  }
  node {
    input: "553"
    input: "541"
    output: "554"
    name: "Add_79"
    op_type: "Add"
  }
  node {
    input: "554"
    input: "914"
    input: "915"
    output: "913"
    name: "Conv_80"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "913"
    output: "557"
    name: "Sigmoid_81"
    op_type: "Sigmoid"
  }
  node {
    input: "913"
    input: "557"
    output: "558"
    name: "Mul_82"
    op_type: "Mul"
  }
  node {
    input: "558"
    input: "917"
    input: "918"
    output: "916"
    name: "Conv_83"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "916"
    output: "561"
    name: "Sigmoid_84"
    op_type: "Sigmoid"
  }
  node {
    input: "916"
    input: "561"
    output: "562"
    name: "Mul_85"
    op_type: "Mul"
  }
  node {
    input: "562"
    input: "554"
    output: "563"
    name: "Add_86"
    op_type: "Add"
  }
  node {
    input: "563"
    input: "920"
    input: "921"
    output: "919"
    name: "Conv_87"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "919"
    output: "566"
    name: "Sigmoid_88"
    op_type: "Sigmoid"
  }
  node {
    input: "919"
    input: "566"
    output: "567"
    name: "Mul_89"
    op_type: "Mul"
  }
  node {
    input: "567"
    input: "923"
    input: "924"
    output: "922"
    name: "Conv_90"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "922"
    output: "570"
    name: "Sigmoid_91"
    op_type: "Sigmoid"
  }
  node {
    input: "922"
    input: "570"
    output: "571"
    name: "Mul_92"
    op_type: "Mul"
  }
  node {
    input: "571"
    input: "563"
    output: "572"
    name: "Add_93"
    op_type: "Add"
  }
  node {
    input: "572"
    input: "545"
    output: "573"
    name: "Concat_94"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "573"
    input: "926"
    input: "927"
    output: "925"
    name: "Conv_95"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "925"
    output: "576"
    name: "Sigmoid_96"
    op_type: "Sigmoid"
  }
  node {
    input: "925"
    input: "576"
    output: "577"
    name: "Mul_97"
    op_type: "Mul"
  }
  node {
    input: "577"
    input: "929"
    input: "930"
    output: "928"
    name: "Conv_98"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "928"
    output: "580"
    name: "Sigmoid_99"
    op_type: "Sigmoid"
  }
  node {
    input: "928"
    input: "580"
    output: "581"
    name: "Mul_100"
    op_type: "Mul"
  }
  node {
    input: "581"
    input: "935"
    input: "936"
    output: "934"
    name: "Conv_104"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "581"
    input: "932"
    input: "933"
    output: "931"
    name: "Conv_101"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "934"
    output: "588"
    name: "Sigmoid_105"
    op_type: "Sigmoid"
  }
  node {
    input: "931"
    output: "584"
    name: "Sigmoid_102"
    op_type: "Sigmoid"
  }
  node {
    input: "934"
    input: "588"
    output: "589"
    name: "Mul_106"
    op_type: "Mul"
  }
  node {
    input: "931"
    input: "584"
    output: "585"
    name: "Mul_103"
    op_type: "Mul"
  }
  node {
    input: "585"
    input: "938"
    input: "939"
    output: "937"
    name: "Conv_107"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "937"
    output: "592"
    name: "Sigmoid_108"
    op_type: "Sigmoid"
  }
  node {
    input: "937"
    input: "592"
    output: "593"
    name: "Mul_109"
    op_type: "Mul"
  }
  node {
    input: "593"
    input: "941"
    input: "942"
    output: "940"
    name: "Conv_110"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "940"
    output: "596"
    name: "Sigmoid_111"
    op_type: "Sigmoid"
  }
  node {
    input: "940"
    input: "596"
    output: "597"
    name: "Mul_112"
    op_type: "Mul"
  }
  node {
    input: "597"
    input: "585"
    output: "598"
    name: "Add_113"
    op_type: "Add"
  }
  node {
    input: "598"
    input: "944"
    input: "945"
    output: "943"
    name: "Conv_114"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "943"
    output: "601"
    name: "Sigmoid_115"
    op_type: "Sigmoid"
  }
  node {
    input: "943"
    input: "601"
    output: "602"
    name: "Mul_116"
    op_type: "Mul"
  }
  node {
    input: "602"
    input: "947"
    input: "948"
    output: "946"
    name: "Conv_117"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "946"
    output: "605"
    name: "Sigmoid_118"
    op_type: "Sigmoid"
  }
  node {
    input: "946"
    input: "605"
    output: "606"
    name: "Mul_119"
    op_type: "Mul"
  }
  node {
    input: "606"
    input: "598"
    output: "607"
    name: "Add_120"
    op_type: "Add"
  }
  node {
    input: "607"
    input: "950"
    input: "951"
    output: "949"
    name: "Conv_121"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "949"
    output: "610"
    name: "Sigmoid_122"
    op_type: "Sigmoid"
  }
  node {
    input: "949"
    input: "610"
    output: "611"
    name: "Mul_123"
    op_type: "Mul"
  }
  node {
    input: "611"
    input: "953"
    input: "954"
    output: "952"
    name: "Conv_124"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "952"
    output: "614"
    name: "Sigmoid_125"
    op_type: "Sigmoid"
  }
  node {
    input: "952"
    input: "614"
    output: "615"
    name: "Mul_126"
    op_type: "Mul"
  }
  node {
    input: "615"
    input: "607"
    output: "616"
    name: "Add_127"
    op_type: "Add"
  }
  node {
    input: "616"
    input: "589"
    output: "617"
    name: "Concat_128"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "617"
    input: "956"
    input: "957"
    output: "955"
    name: "Conv_129"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "955"
    output: "620"
    name: "Sigmoid_130"
    op_type: "Sigmoid"
  }
  node {
    input: "955"
    input: "620"
    output: "621"
    name: "Mul_131"
    op_type: "Mul"
  }
  node {
    input: "621"
    input: "959"
    input: "960"
    output: "958"
    name: "Conv_132"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "958"
    output: "624"
    name: "Sigmoid_133"
    op_type: "Sigmoid"
  }
  node {
    input: "958"
    input: "624"
    output: "625"
    name: "Mul_134"
    op_type: "Mul"
  }
  node {
    input: "625"
    input: "962"
    input: "963"
    output: "961"
    name: "Conv_135"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "961"
    output: "628"
    name: "Sigmoid_136"
    op_type: "Sigmoid"
  }
  node {
    input: "961"
    input: "628"
    output: "629"
    name: "Mul_137"
    op_type: "Mul"
  }
  node {
    input: "629"
    output: "632"
    name: "MaxPool_140"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 13
      ints: 13
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 6
      ints: 6
      ints: 6
      ints: 6
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "629"
    output: "631"
    name: "MaxPool_139"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 9
      ints: 9
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 4
      ints: 4
      ints: 4
      ints: 4
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "629"
    output: "630"
    name: "MaxPool_138"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "629"
    input: "630"
    input: "631"
    input: "632"
    output: "633"
    name: "Concat_141"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "633"
    input: "965"
    input: "966"
    output: "964"
    name: "Conv_142"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "964"
    output: "636"
    name: "Sigmoid_143"
    op_type: "Sigmoid"
  }
  node {
    input: "964"
    input: "636"
    output: "637"
    name: "Mul_144"
    op_type: "Mul"
  }
  node {
    input: "637"
    input: "971"
    input: "972"
    output: "970"
    name: "Conv_148"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "637"
    input: "968"
    input: "969"
    output: "967"
    name: "Conv_145"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "970"
    output: "644"
    name: "Sigmoid_149"
    op_type: "Sigmoid"
  }
  node {
    input: "967"
    output: "640"
    name: "Sigmoid_146"
    op_type: "Sigmoid"
  }
  node {
    input: "970"
    input: "644"
    output: "645"
    name: "Mul_150"
    op_type: "Mul"
  }
  node {
    input: "967"
    input: "640"
    output: "641"
    name: "Mul_147"
    op_type: "Mul"
  }
  node {
    input: "641"
    input: "974"
    input: "975"
    output: "973"
    name: "Conv_151"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "973"
    output: "648"
    name: "Sigmoid_152"
    op_type: "Sigmoid"
  }
  node {
    input: "973"
    input: "648"
    output: "649"
    name: "Mul_153"
    op_type: "Mul"
  }
  node {
    input: "649"
    input: "977"
    input: "978"
    output: "976"
    name: "Conv_154"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "976"
    output: "652"
    name: "Sigmoid_155"
    op_type: "Sigmoid"
  }
  node {
    input: "976"
    input: "652"
    output: "653"
    name: "Mul_156"
    op_type: "Mul"
  }
  node {
    input: "653"
    input: "645"
    output: "654"
    name: "Concat_157"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "654"
    input: "980"
    input: "981"
    output: "979"
    name: "Conv_158"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "979"
    output: "657"
    name: "Sigmoid_159"
    op_type: "Sigmoid"
  }
  node {
    input: "979"
    input: "657"
    output: "658"
    name: "Mul_160"
    op_type: "Mul"
  }
  node {
    input: "658"
    input: "983"
    input: "984"
    output: "982"
    name: "Conv_161"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "982"
    output: "661"
    name: "Sigmoid_162"
    op_type: "Sigmoid"
  }
  node {
    input: "982"
    input: "661"
    output: "662"
    name: "Mul_163"
    op_type: "Mul"
  }
  node {
    input: "662"
    input: "666"
    input: "1099"
    output: "667"
    name: "Resize_165"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "667"
    input: "621"
    output: "668"
    name: "Concat_166"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "668"
    input: "989"
    input: "990"
    output: "988"
    name: "Conv_170"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "668"
    input: "986"
    input: "987"
    output: "985"
    name: "Conv_167"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "988"
    output: "675"
    name: "Sigmoid_171"
    op_type: "Sigmoid"
  }
  node {
    input: "985"
    output: "671"
    name: "Sigmoid_168"
    op_type: "Sigmoid"
  }
  node {
    input: "988"
    input: "675"
    output: "676"
    name: "Mul_172"
    op_type: "Mul"
  }
  node {
    input: "985"
    input: "671"
    output: "672"
    name: "Mul_169"
    op_type: "Mul"
  }
  node {
    input: "672"
    input: "992"
    input: "993"
    output: "991"
    name: "Conv_173"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "991"
    output: "679"
    name: "Sigmoid_174"
    op_type: "Sigmoid"
  }
  node {
    input: "991"
    input: "679"
    output: "680"
    name: "Mul_175"
    op_type: "Mul"
  }
  node {
    input: "680"
    input: "995"
    input: "996"
    output: "994"
    name: "Conv_176"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "994"
    output: "683"
    name: "Sigmoid_177"
    op_type: "Sigmoid"
  }
  node {
    input: "994"
    input: "683"
    output: "684"
    name: "Mul_178"
    op_type: "Mul"
  }
  node {
    input: "684"
    input: "676"
    output: "685"
    name: "Concat_179"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "685"
    input: "998"
    input: "999"
    output: "997"
    name: "Conv_180"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "997"
    output: "688"
    name: "Sigmoid_181"
    op_type: "Sigmoid"
  }
  node {
    input: "997"
    input: "688"
    output: "689"
    name: "Mul_182"
    op_type: "Mul"
  }
  node {
    input: "689"
    input: "1001"
    input: "1002"
    output: "1000"
    name: "Conv_183"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1000"
    output: "692"
    name: "Sigmoid_184"
    op_type: "Sigmoid"
  }
  node {
    input: "1000"
    input: "692"
    output: "693"
    name: "Mul_185"
    op_type: "Mul"
  }
  node {
    input: "693"
    input: "666"
    input: "1099"
    output: "698"
    name: "Resize_187"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "698"
    input: "577"
    output: "699"
    name: "Concat_188"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "699"
    input: "1007"
    input: "1008"
    output: "1006"
    name: "Conv_192"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "699"
    input: "1004"
    input: "1005"
    output: "1003"
    name: "Conv_189"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1006"
    output: "706"
    name: "Sigmoid_193"
    op_type: "Sigmoid"
  }
  node {
    input: "1003"
    output: "702"
    name: "Sigmoid_190"
    op_type: "Sigmoid"
  }
  node {
    input: "1006"
    input: "706"
    output: "707"
    name: "Mul_194"
    op_type: "Mul"
  }
  node {
    input: "1003"
    input: "702"
    output: "703"
    name: "Mul_191"
    op_type: "Mul"
  }
  node {
    input: "703"
    input: "1010"
    input: "1011"
    output: "1009"
    name: "Conv_195"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1009"
    output: "710"
    name: "Sigmoid_196"
    op_type: "Sigmoid"
  }
  node {
    input: "1009"
    input: "710"
    output: "711"
    name: "Mul_197"
    op_type: "Mul"
  }
  node {
    input: "711"
    input: "1013"
    input: "1014"
    output: "1012"
    name: "Conv_198"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1012"
    output: "714"
    name: "Sigmoid_199"
    op_type: "Sigmoid"
  }
  node {
    input: "1012"
    input: "714"
    output: "715"
    name: "Mul_200"
    op_type: "Mul"
  }
  node {
    input: "715"
    input: "707"
    output: "716"
    name: "Concat_201"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "716"
    input: "1016"
    input: "1017"
    output: "1015"
    name: "Conv_202"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1015"
    output: "719"
    name: "Sigmoid_203"
    op_type: "Sigmoid"
  }
  node {
    input: "1015"
    input: "719"
    output: "720"
    name: "Mul_204"
    op_type: "Mul"
  }
  node {
    input: "720"
    input: "1055"
    input: "1056"
    output: "1054"
    name: "Conv_245"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "720"
    input: "1019"
    input: "1020"
    output: "1018"
    name: "Conv_205"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "1054"
    output: "775"
    name: "Sigmoid_246"
    op_type: "Sigmoid"
  }
  node {
    input: "1018"
    output: "723"
    name: "Sigmoid_206"
    op_type: "Sigmoid"
  }
  node {
    input: "1054"
    input: "775"
    output: "776"
    name: "Mul_247"
    op_type: "Mul"
  }
  node {
    input: "1018"
    input: "723"
    output: "724"
    name: "Mul_207"
    op_type: "Mul"
  }
  node {
    input: "776"
    input: "1064"
    input: "1065"
    output: "1063"
    name: "Conv_255"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "776"
    input: "1058"
    input: "1059"
    output: "1057"
    name: "Conv_248"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "724"
    input: "693"
    output: "725"
    name: "Concat_208"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "1063"
    output: "788"
    name: "Sigmoid_256"
    op_type: "Sigmoid"
  }
  node {
    input: "1057"
    output: "779"
    name: "Sigmoid_249"
    op_type: "Sigmoid"
  }
  node {
    input: "725"
    input: "1025"
    input: "1026"
    output: "1024"
    name: "Conv_212"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "725"
    input: "1022"
    input: "1023"
    output: "1021"
    name: "Conv_209"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
